Catalogs/КластерСервераПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>КластерСервераПриложений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Защищен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяАдминистратораКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольАдминистратораКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПлатформы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СостоянияЭлементовКластера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СостоянияЭлементовКластера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеАктивен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗарегестрирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КластерСервераПриложений/Ext/ManagerModule.bsl
// Получает идентификатор кластера по ссылке, объекту или структуре.
//
// Параметры:
//  ПараметрыКластера - Структура - СправочникОбъект.КластерСервераПриложений, СправочникСсылка.КластерСервераПриложений
//
// Возвращаемое значение:
//   Идентификатор - Строка - Уникальный идентификатор кластера
//
Функция ПолучитьИдентификаторКластера(Кластер) Экспорт
	
	ПараметрыАдминистрированияКластера = ПолучитьПараметрыАдминистрированияКластера(Кластер);
	
	Возврат АдминистрированиеКластера.ИдентификаторКластера(ПараметрыАдминистрированияКластера);
	
КонецФункции

Функция ПолучитьСостояниеКластера(Кластер) Экспорт
	
	Попытка
		ИдентификаторКластера = ПолучитьИдентификаторКластера(Кластер);	
	Исключение
		ИдентификаторКластера = Неопределено;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ИдентификаторКластера) Тогда

		Возврат Перечисления.СостоянияЭлементовКластера.НеАктивен;
		
	ИначеЕсли Кластер.ИдентификаторКластера = ИдентификаторКластера Тогда
		
		Возврат Перечисления.СостоянияЭлементовКластера.Активен;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПараметрыАдминистрированияКластера(Кластер) Экспорт
	
	ПараметрыАдминистрированияКластера = АдминистрированиеКластера.ПараметрыАдминистрированияКластера();
	ЗаполнитьЗначенияСвойств(ПараметрыАдминистрированияКластера, Кластер);
	
	Возврат ПараметрыАдминистрированияКластера;
		
КонецФункции

Функция ПолучитьМакетОписанияКластера(Кластер) Экспорт
	
	МакетСводнойИнформации = Справочники.КластерСервераПриложений.ПолучитьМакет("МакетСводнойИнформации");
	
	ОбластьЗаголовок				= МакетСводнойИнформации.ПолучитьОбласть("Заголовок");
	ОбластьСтрокаСоставаКластера	= МакетСводнойИнформации.ПолучитьОбласть("СтрокаСоставаКластера");
	ОбластьПодробнее				= МакетСводнойИнформации.ПолучитьОбласть("ОбластьПодробнее");	
	ОбластьБазыЗаголовок			= МакетСводнойИнформации.ПолучитьОбласть("БазыЗаголовок");
	ОбластьБазыСтрока				= МакетСводнойИнформации.ПолучитьОбласть("БазыСтрока");
	
	ТабличныйДокументОписание = Новый ТабличныйДокумент();
	ТабличныйДокументОписание.Вывести(ОбластьЗаголовок);
	
	ПараметрыАдминистрированияКластера = ПолучитьПараметрыАдминистрированияКластера(Кластер);
	
	ОписаниеКластераМассив = АдминистрированиеКластера.СвойстваКластеров(ПараметрыАдминистрированияКластера);
	
	Для Каждого ЭлементМассиваКластеров Из ОписаниеКластераМассив Цикл
		
		ОбластьСтрокаСоставаКластера.Параметры.ИмяКластера		= ЭлементМассиваКластеров["name"];  	
		ОбластьСтрокаСоставаКластера.Параметры.ИмяКомпьютера	= ЭлементМассиваКластеров["host"];
		ОбластьСтрокаСоставаКластера.Параметры.ПортКластера 	= ЭлементМассиваКластеров["port"]; 
		ОбластьСтрокаСоставаКластера.Параметры.Идинтификатор	= ЭлементМассиваКластеров["cluster"]; 
		ТабличныйДокументОписание.Вывести(ОбластьСтрокаСоставаКластера);
		
		ОбластьПодробнее.Параметры.ОписаниеКластера = Новый Структура("ПараметрыКластера", ЭлементМассиваКластеров);
		ТабличныйДокументОписание.Вывести(ОбластьПодробнее);
		
	КонецЦикла;
	
	МассивБазКластера = АдминистрированиеКластера.СвойстваИнформационныхБаз(Кластер.ИдентификаторКластера, 
																				 ПараметрыАдминистрированияКластера);

	ТабличныйДокументОписание.Вывести(ОбластьБазыЗаголовок);

	Для Каждого БазаКластера Из МассивБазКластера Цикл
		
		ЗарегестрированнаяБаза = Справочники.ИнформационныеБазы.НайтиПоРеквизиту("ИдентификаторБазы", 
																						БазаКластера["infobase"]);
		
		Если Не ЗначениеЗаполнено(ЗарегестрированнаяБаза) Тогда
			ОбластьБазыСтрока.Параметры.НаименованиеБазы = БазаКластера["name"];
			ОбластьБазыСтрока.Параметры.ПараметрыБазы = Новый Структура("ПараметрыБазы", БазаКластера);	
			ТабличныйДокументОписание.Вывести(ОбластьБазыСтрока);
		КонецЕсли;
					
	КонецЦикла;
	
	Возврат ТабличныйДокументОписание;
	
КонецФункции
